import express from "express";

const router = express.Router();

const  quotes = [
    {
        quote : "गीता में कहा गया है कोई भी अपने कर्म से भाग नहीं सकता कर्म का फल तो भुगतना ही पड़ता है।",
        source : "श्रीमद्भगवदगीता"
    },
    {
        quote : "जिस मनुष्य के पास सब्र की ताकत है,उस मनुष्य की ताकत का कोई मुकाबला नहीं कर सकता।",
        source : "श्रीमद्भगवदगीता"
    },
    {
        quote : "व्यक्ति जो चाहे बन सकता है,यदि विश्वास के साथ इच्छित वस्तु पर लगातार चिन्तन करे।",
        source : "श्रीमद्भगवदगीता"
    },
    {
        quote : "निंदा से घबराकर अपने लक्ष्य को कभी न छोड़े, क्योंकि लक्ष्य मिलते ही निंदा करने वालों की राय बदल जाती है।",
        source : "श्रीमद्भगवदगीता"
    },
    {
        quote : " जिंदगी में हम कितने सही हैं और कितने गलत हैं यह केवल दो लोग जानते हैं,एक परमात्मा और दूसरी हमारी अंतरात्मा।",
        source : "श्रीमद्भगवदगीता"
    },
    {
        quote : "जो मन को नियंत्रित नहीं करते उनके लिए वह शत्रु के समान कार्य करता है।",
        source : "श्रीमद्भगवदगीता"
    },
    { 
        quote : "हे अर्जुन! समय से पहले और भाग्य से अधिक कभी किसी को कुछ नही मिलता है।",
        source : "श्रीमद्भगवदगीता"
    },
    {
        quote : "मन अशांत है और उसे नियंत्रित करना कठिन है,लेकिन अभ्यास से इसे वश में किया जा सकता है।",
        source :"श्रीमद्भगवदगीता"
    },
    {
        quote : "जो दान बिना सत्कार के कुपात्र को दिया जाता है वह तमस दान कहलाता है।",
        source : "श्रीमद्भगवदगीता"
    },
    {
        quote : "सफलता जिस ताले में बंद रहती है वह दो चाबियों से खुलती है। एक कठिन परिश्रम और दूसरा दृढ संकल्प ।",
        source : "श्रीमद्भगवदगीता"
    },
    {
        quote : "मनुष्य अपने विश्वास से निर्मित होता है,जैसा वह विश्वास करता है,वैसा वह बन जाता है।",
        source : "श्रीमद्भगवदगीता"
    },
    {
        quote : "कुछ वस्तु लेना उसी इन्सान से सही रहा है, जो बदले में किसी वस्तु पाने की लालसा न रखता हो |",
        source : "श्रीमद्भगवदगीता"
    },
    {
        quote : "जो चीज हमारे दायरे से बाहर हो,उसमें समय गंवाना मूर्खता ही होगी.",
        source : "श्रीमद्भगवदगीता"
    },
    {
        quote : "उससे मत डरो जो वास्तविक नहीं है, ना कभी था ना कभी होगा,जो वास्तविक है, वो हमेशा था और उसे कभी नष्ट नहीं किया जा सकता.",
        source : "श्रीमद्भगवदगीता"
    },
    {
        quote : "कोई भी दुख इस संसार में इतना बडा नही है, जिसका कोई उपाय न हो,लेकिन मनुष्य प्रयत्न ही नही करना चाहता, वह जल्दी ही हार स्वीकार कर लेता है |",
        source : "श्रीमद्भगवदगीता"
    },
    {
        quote : "खुद को जीवन के योग्य बनाना ही सफलता और सुख का एक मात्र मार्ग है।",
        source : "श्रीमद्भगवदगीता"
    },
    {
        quote : "कर्म करो, फल की चिंता मत करो। ",
        source : "श्रीमद्भगवदगीता"
    },
    {
        quote : "जो हुआ वह अच्छा हुआ, जो हो रहा है वह अच्छा हो रहा है, जो होगा वो भी अच्छा ही होगा।",
        source : "श्रीमद्भगवदगीता"
    },
    {
        quote : "जब भी और जहाँ भी अधर्म बढ़ेगा। तब मैं धर्म की स्थापना हेतु, अवतार लेता रहूँगा।",
        source : "श्रीमद्भगवदगीता"
    },
    {
        quote : "भक्तों का उद्धार करने, दुष्टों का विनाश करने तथा धर्म की फिर से स्थापना करने के लिए मैं हर युग में प्रकट होता हूँ।",
        source : "श्रीमद्भगवदगीता"
    },
    {
        quote : "हे अर्जुन! मैं वह काम हूँ, जो धर्म के विरुद्ध नहीं है।",
        source : "श्रीमद्भगवदगीता"
    },
    {
        quote : "हे अर्जुन! जो मेरे आविर्भाव के सत्य को समझ लेता है, वह इस शरीर को छोड़ने पर इस भौतिक संसार में पुनर्जन्म नहीं लेता, अपितु मेरे धाम को प्राप्त होता है।",
        source : "श्रीमद्भगवदगीता"
    },
    {
        quote : "निर्बलता अवश्य ईश्वर देता है किन्तु मर्यादा मनुष्य का मन ही निर्मित करता है।",
        source : "श्रीमद्भगवदगीता"
    },
    {
        quote : "डर धारण करने से भविष्य के दुख का निवारण नहीं होता है। डर केवल आने वाले दुख की कल्पना ही है।",
        source : "श्रीमद्भगवदगीता"
    },
    {
        quote : "हे अर्जुन! क्रोध से भ्रम पैदा होता है, भ्रम से बुद्धि व्यग्र होती है, जब बुद्धि व्यग्र होती है, तब तर्क नष्ट हो जाता है, जब तर्क नष्ट होता है तब व्यक्ति का पतन हो जाता है।",
        source : "श्रीमद्भगवदगीता"
    },
    {
        quote : "प्रत्येक बुद्धिमान व्यक्ति को क्रोध और लोभ त्याग देना चाहिए क्योंकि इससे आत्मा का पतन होता है।",
        source : "श्रीमद्भगवदगीता"
    },
        {
        quote : "जिस मनुष्य के पास सब्र की ताकत हैउस मनुष्य की ताकत का कोईमुकाबला नहीं कर सकता।",
        source : "श्रीमद्भगवदगीता"
    },
    {
        quote : "ज्यादा खुश होने पर औरज्यादा दुखी होने पर निर्णय नहीं लेना चाहिएक्योंकि यह दोनों परिस्थितियां आपकोसही निर्णय नहीं लेने देती हैं।",
        source : "श्रीमद्भगवदगीता"
    },
    {
        quote : "गीता में कहा गया हैजो इंसान किसी की कमी कोपूरी करता है वोसही अर्थों में महान होता है..!",
        source : "श्रीमद्भगवदगीता"
    },
    {
        quote : "याद रखना अगर बुरे लोग सिर्फसमझाने से समझ जाते तोबांसुरी बजाने वाला भीकभी महाभारत होने नहीं देता।",
        source : "श्रीमद्भगवदगीता"
    }
]

router.get('/',(req, res) => {
    console.log(quotes);
    res.send(quotes);
})

export default router;